renesas/amazon-freertos/vendors/renesas/boards/rl78g14-fpb/amazon_freertos_common/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
#define ULPGN_UART_DEFAULT_PORT (0)
#define ULPGN_UART_SECOND_PORT (1)

#define MUTEX_TX (1 << 0)
#define MUTEX_RX (1 << 1)

uint8_t ULPGN_USE_UART_NUM = 2;

uint32_t g_wifi_tx_busiz_command;
uint32_t g_wifi_tx_busiz_data;
uint32_t g_wifi_rx_busiz_command;
uint32_t g_wifi_rx_busiz_data;

uint8_t g_wifi_createble_sockets;
uint8_t wifi_command_port;
uint8_t wifi_data_port;

uint8_t  g_wifi_transparent_mode = 0;

const uint8_t ulpgn_socket_status_closed[]       = ULPGN_SOCKET_STATUS_TEXT_CLOSED;
const uint8_t ulpgn_socket_status_socket[]       = ULPGN_SOCKET_STATUS_TEXT_SOCKET;
const uint8_t ulpgn_socket_status_bound[]        = ULPGN_SOCKET_STATUS_TEXT_BOUND;
const uint8_t ulpgn_socket_status_listen[]       = ULPGN_SOCKET_STATUS_TEXT_LISTEN;
const uint8_t ulpgn_socket_status_connected[]    = ULPGN_SOCKET_STATUS_TEXT_CONNECTED;

const uint8_t ulpgn_return_dummy[]   = "";

const uint32_t g_wifi_serial_buffsize_table[2][4] =
{
    /*SCI_TX_BUSIZ_DEFAULT*//*SCI_TX_BUSIZ_SIZE*/   /*SCI_RX_BUSIZ_DEFAULT*/ /*SCI_RX_BUSIZ_SIZE*/
    {SCI_TX_BUSIZ_DEFAULT,  SCI_TX_BUSIZ_DEFAULT,  SCI_RX_BUSIZ_DEFAULT,  SCI_RX_BUSIZ_DEFAULT,  }, /*ULPGN_USE_UART_NUM = 1 */
    {SCI_TX_BUSIZ_SECOND,   SCI_TX_BUSIZ_DEFAULT,  SCI_TX_BUSIZ_SECOND,   SCI_RX_BUSIZ_DEFAULT,  }, /*ULPGN_USE_UART_NUM = 2 */
};


const uint8_t * const wifi_socket_status_tbl[ULPGN_SOCKET_STATUS_MAX] =
{
    ulpgn_socket_status_closed,
    ulpgn_socket_status_socket,
    ulpgn_socket_status_bound,
    ulpgn_socket_status_listen,
    ulpgn_socket_status_connected,
};

volatile uint8_t current_socket_index;

#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
WIFI_CertificateProfile_t certificate_profile[5];
#endif
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
WIFI_CertificateProfile_t certificate_profile[2];
#endif

/* Wifi Execute Command Timeout */
uint16_t g_command_execute_timeout1 = EXECUTE_COMMAND_TIMEOUT_DEFAULT1;
uint16_t g_command_execute_timeout2 = EXECUTE_COMMAND_TIMEOUT_DEFAULT2;
uint16_t g_command_execute_timeout3 = EXECUTE_COMMAND_TIMEOUT_DEFAULT3;
uint16_t g_command_execute_timeout4 = EXECUTE_COMMAND_TIMEOUT_DEFAULT4;
uint16_t g_command_execute_timeout5 = EXECUTE_COMMAND_TIMEOUT_DEFAULT5;

static int32_t wifi_execute_at_command(uint8_t serial_ch_id, const uint8_t *ptextstring, uint16_t timeout_ms, wifi_return_code_t expect_code,  wifi_command_list_t command, int32_t socket_number);

static int32_t wifi_take_mutex(uint8_t mutex_flag);
static void wifi_give_mutex(uint8_t mutex_flag);

static void wifi_uart_callback_second_port_for_command(void *pArgs);
static void wifi_uart_callback_default_port_for_inititial(void *pArgs);
static void wifi_uart_callback_default_port_for_data(void *pArgs);
static void timeout_init(int32_t serial_ch, uint16_t timeout_ms);
//static void bytetimeout_init(int32_t serial_ch, uint16_t timeout_ms);
static int32_t check_timeout(int32_t serial_ch, int32_t rcvcount);
//static int32_t check_bytetimeout(int32_t serial_ch, int32_t rcvcount);
static void socket_timeout_init(uint8_t socket_number, uint32_t timeout_ms, uint8_t flag);
static int32_t socket_check_timeout(uint8_t socket_number, uint8_t flag);

static int32_t wifi_get_ipaddress(void);
static int32_t wifi_serial_open_for_initial(void);
static int32_t wifi_serial_open_for_data(void);
static int32_t wifi_serial_default_port_close(void);
static int32_t wifi_change_command_mode(void);
static int32_t wifi_change_transparent_mode(void);
static int32_t wifi_serial_second_port_open(void);
static int32_t wifi_serial_second_port_close(void);
static int32_t wifi_check_uart_state(uint32_t *uart_receive_status, uint32_t *uart_send_status);

static int32_t wifi_serial_close(void);

static int32_t wifi_get_socket_status(uint8_t socket_number);
static int32_t wifi_change_socket_index(uint8_t socket_number);
//static int32_t wifi_dns_query(uint8_t *domain_name, uint32_t *ipaddress);


/**
 * @brief The global mutex to ensure that only one operation is accessing the
 * g_wifi_tx_semaphore flag at one time.
 */
static SemaphoreHandle_t g_wifi_tx_semaphore = NULL;
static SemaphoreHandle_t g_wifi_rx_semaphore = NULL;

/**
 * @brief Maximum time in ticks to wait for obtaining a semaphore.
 */
static const TickType_t xMaxSemaphoreBlockTime = pdMS_TO_TICKS( 10000UL );

static uint8_t g_temporary_byteq_enable_flag = 0;
static uint8_t g_sockindex_command_flag = 0;

wifi_system_status_t g_wifi_system_state = WIFI_SYSTEM_CLOSE;
uint8_t g_wifi_at_command_buff[WIFI_AT_COMMAND_BUFF_SIZE];
uint8_t g_wifi_at_response_buff[WIFI_AT_RESPONSE_BUFF_SIZE];

wifi_at_communication_info_t g_wifi_uart[WIFI_NUMBER_OF_USE_UART];

uint32_t g_wifi_tx_busiz_command;
uint32_t g_wifi_tx_busiz_data;
uint32_t g_wifi_rx_busiz_command;
uint32_t g_wifi_rx_busiz_data;

uint32_t g_wifi_sci_err_flag;

/**
* @fn
* @brief WiFi Module Open
* @param : None
*/
wifi_err_t R_WIFI_SX_ULPGN_Open(void)
{
    int32_t ret;
    sci_baud_t change_baud;
	wifi_err_t api_ret = WIFI_SUCCESS;
	uint8_t open_phase;
	uint8_t byteq_open_count;
	int32_t k;

	if( WIFI_SYSTEM_CLOSE != g_wifi_system_state)
	{
		return WIFI_ERR_ALREADY_OPEN;
	}

	/* Memory initialize */

	wifi_command_port = WIFI_UART_COMMAND_PORT;

    memset(g_wifi_uart, 0, sizeof(g_wifi_uart));
    g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff = g_wifi_at_command_buff;
    g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff_size = sizeof(g_wifi_at_command_buff);
    g_wifi_uart[WIFI_UART_COMMAND_PORT].response_buff = g_wifi_at_response_buff;
    g_wifi_uart[WIFI_UART_COMMAND_PORT].response_buff_size = sizeof(g_wifi_at_response_buff);
    g_wifi_uart[WIFI_UART_DATA_PORT].command_buff = g_wifi_at_command_buff;
    g_wifi_uart[WIFI_UART_DATA_PORT].command_buff_size = sizeof(g_wifi_at_command_buff);
    g_wifi_uart[WIFI_UART_DATA_PORT].response_buff = g_wifi_at_response_buff;
    g_wifi_uart[WIFI_UART_DATA_PORT].response_buff_size = sizeof(g_wifi_at_response_buff);

	g_wifi_tx_busiz_command = g_wifi_serial_buffsize_table[0][0];
	g_wifi_tx_busiz_data    = g_wifi_serial_buffsize_table[0][0];
	g_wifi_rx_busiz_command = g_wifi_serial_buffsize_table[0][1];
	g_wifi_rx_busiz_data    = g_wifi_serial_buffsize_table[0][1];

