renesas/amazon-freertos/vendors/renesas/boards/rl78g14-fpb/amazon_freertos_common/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
	memset(g_wifi_socket, 0, sizeof(g_wifi_socket));

	wifi_init_at_execute_queue();

	open_phase = 0;
	/* Phase 1: ByteQ initialize */
	for(byteq_open_count = 0;byteq_open_count <WIFI_CFG_CREATABLE_SOCKETS; byteq_open_count++)
	{
		if(BYTEQ_SUCCESS != R_BYTEQ_Open(g_wifi_socket[byteq_open_count].socket_recv_buff, sizeof(g_wifi_socket[byteq_open_count].socket_recv_buff), &g_wifi_socket[byteq_open_count].socket_byteq_hdl))
		{
			break;
		}
	}

	if(byteq_open_count >= WIFI_CFG_CREATABLE_SOCKETS)
	{
		/* Success */
		open_phase |= 0x01;
	}
	else
	{
		api_ret = WIFI_ERR_BYTEQ_OPEN;
	}

	if(WIFI_SUCCESS == api_ret)
	{
	    /* Phase 3 Semaphore tx initialize */
	    if (g_wifi_tx_semaphore != NULL)
	    {
	        vSemaphoreDelete(g_wifi_tx_semaphore);
	    }
	    g_wifi_tx_semaphore = xSemaphoreCreateMutex();

	    if( g_wifi_tx_semaphore != NULL )
	    {
			/* Success */
			open_phase |= 0x02;
	    }
	    else
	    {
	    	api_ret = WIFI_ERR_TAKE_MUTEX;
	    }
	}

	if(WIFI_SUCCESS == api_ret)
	{
	    /* Phase 4 Semaphore rx initialize */
	    if (g_wifi_rx_semaphore != NULL)
	    {
	        vSemaphoreDelete(g_wifi_rx_semaphore);
	    }

	    g_wifi_rx_semaphore = xSemaphoreCreateMutex();

	    if( g_wifi_rx_semaphore != NULL )
	    {
			/* Success */
			open_phase |= 0x04;
	    }
	    else
	    {
	    	api_ret = WIFI_ERR_TAKE_MUTEX;
	    }
	}

	if(WIFI_SUCCESS == api_ret)
	{
	    /* Phase 4 Serial initialize */
#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
        WIFI_RESET_DR(WIFI_CFG_RESET_PORT, WIFI_CFG_RESET_PIN) = 0;
        WIFI_RESET_DDR(WIFI_CFG_RESET_PORT, WIFI_CFG_RESET_PIN) = 1;
#endif
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
		WIFI_CFG_RESET_PORT_PODR = 0;
#endif
	    R_BSP_SoftwareDelay(26, BSP_DELAY_MILLISECS); /* 5us mergin 1us */
#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
		WIFI_RESET_DR(WIFI_CFG_RESET_PORT, WIFI_CFG_RESET_PIN) = 1;
#endif
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
		WIFI_CFG_RESET_PORT_PODR = 1;
#endif
	    R_BSP_SoftwareDelay(250, BSP_DELAY_MILLISECS); /*  */

		ret = wifi_serial_open_for_initial();
		if(0 == ret)
		{
			/* Success */
			open_phase |= 0x08;
		}
		else
		{
	    	api_ret = WIFI_ERR_SERIAL_OPEN;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
	    ret = wifi_serial_second_port_open();
	    ret = 0;
	    if(ret == 0)
	    {
			/* Success */
			open_phase |= 0x10;
	    }
	    else
	    {
	    	api_ret = WIFI_ERR_SERIAL_OPEN;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
	    /* Phase 5 Task initialize */
		if(0 == wifi_start_recv_task())
		{
			vTaskDelay( 2 );
			/* Success */
			open_phase |= 0x20;
		}
		else
		{
			api_ret = WIFI_ERR_SERIAL_OPEN;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		/* no echo */
		ret = wifi_execute_at_command(wifi_command_port, "ATE0\r", g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_ECHO_OFF, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}

	if(WIFI_SUCCESS == api_ret)
	{
		/* no echo */
		ret = wifi_execute_at_command(wifi_command_port, "ATWREV\r", g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_MODULE_VERSION, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
	    /* Command Port = HSUART2 */
		ret = wifi_execute_at_command(wifi_command_port, "ATUART=2\r", g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_UART_CHANGE_TO_2, 0xff);
	    if(ret != 0)
	    {
			api_ret = WIFI_ERR_MODULE_COM;
	    }
	    else
	    {
	    	R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS); /* 1 sec */
	    	wifi_command_port = ULPGN_UART_SECOND_PORT;
	        wifi_serial_default_port_close();
	        open_phase &= (~0x08);
	    }
	}

	if(WIFI_SUCCESS == api_ret)
	{
		/* Command Port = HSUART2, Data Port = HSUART1 */
		ret = wifi_execute_at_command(wifi_command_port, "ATE0\r", g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_ECHO_OFF, 0xff);
		if(ret == 0)
		{
			/* Multiple Connection */
	        /* Change HSUART1 baudrate and flow control. */
#if (WIFI_CFG_SCI_USE_FLOW_CONTROL == 1)
	        sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATBX1=%lu,,,,h\r",WIFI_CFG_SCI_BAUDRATE);
#else
	        sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATBX1=%lu,,,,\r",WIFI_CFG_SCI_BAUDRATE);
#endif
			ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_UART_HISPEED, 0xff);
	        if(ret != 0)
	        {
	        	api_ret = WIFI_ERR_MODULE_COM;
	        }
	        if(api_ret == WIFI_SUCCESS)
	        {
	        	ret = wifi_serial_open_for_data();
	        	if(ret == 0)
				{
					open_phase |= 0x08;
				}
				else
				{
					api_ret = WIFI_ERR_SERIAL_OPEN;
				}
	        }
	        if(api_ret == WIFI_SUCCESS)
	        {
		        R_SCI_Control(g_wifi_uart[ULPGN_UART_DEFAULT_PORT].wifi_uart_sci_handle, SCI_CMD_EN_CTS_IN, NULL);
#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
		        WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 0;
		        WIFI_RTS_DDR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 1;
#endif
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
		        WIFI_CFG_UART_DEFAULT_SCI_RTS_PODR = 0;
#endif
		        R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS);

				ret = wifi_execute_at_command(wifi_command_port, "ATUART=2,1\r", g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_UART_CHANGE_TO_21, 0xff);
		        if(ret != 0)
		        {
		        	api_ret = WIFI_ERR_MODULE_COM;
		        }

	        }
	        if(api_ret == WIFI_SUCCESS)
	        {
				R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS); /* 1 sec */

				ULPGN_USE_UART_NUM = 2;
				g_wifi_createble_sockets = WIFI_CFG_CREATABLE_SOCKETS;
				wifi_command_port = ULPGN_UART_SECOND_PORT;
				wifi_data_port = ULPGN_UART_DEFAULT_PORT;
				g_wifi_tx_busiz_command = g_wifi_serial_buffsize_table[1][0];
				g_wifi_tx_busiz_data    = g_wifi_serial_buffsize_table[1][1];
				g_wifi_rx_busiz_command = g_wifi_serial_buffsize_table[1][2];
				g_wifi_rx_busiz_data    = g_wifi_serial_buffsize_table[1][3];
	        }

