renesas/amazon-freertos/vendors/renesas/boards/rl78g14-fpb/amazon_freertos_common/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}
	if( WIFI_SYSTEM_OPEN == g_wifi_system_state)
	{
		/* Nothing to do. */
		return WIFI_SUCCESS;
	}

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}
	if(WIFI_SUCCESS == api_ret)
	{
		wifi_change_command_mode();
		wifi_execute_at_command(wifi_command_port, "ATWD\r", g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_WIFI_DISCONNECT, 0xff);
		memset(&g_wifi_ipconfig, 0, sizeof(g_wifi_ipconfig));
		g_wifi_system_state = WIFI_SYSTEM_OPEN;
#if DEBUGLOG ==2
		printf("Disconnected WiFi AP.\r\n");
#endif
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}

    return api_ret;
}

/** 
* @fn
* @brief Check connected Status
*/
int32_t R_WIFI_SX_ULPGN_IsConnected(void)
{
	int32_t ret = -1;

	if(WIFI_SYSTEM_CONNECT == g_wifi_system_state)
	{
		ret = 0;
	}
	return ret;
}


/**
* @fn
* @brief Get Mac Address
*/
wifi_err_t R_WIFI_SX_ULPGN_GetMacAddress (uint8_t *mac_address)
{
	int32_t ret;
	uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;

	if(NULL == mac_address)
	{
		return WIFI_ERR_PARAMETER;
	}
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}
    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}

    if(WIFI_SUCCESS == api_ret)
	{
		ret = wifi_execute_at_command(wifi_command_port, "ATW\r\n", g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_MACADDRESS, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
		memcpy(mac_address, g_wifi_macaddress, sizeof(g_wifi_macaddress));
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}
	return api_ret;
}


/**
* @fn
* @brief Get Ip Address
*/
wifi_err_t R_WIFI_SX_ULPGN_GetIpAddress (wifi_ip_configuration_t *ip_config)
{
	int32_t ret;
	uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;

	if(NULL == ip_config)
	{
		return WIFI_ERR_PARAMETER;
	}
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}

    if(WIFI_SUCCESS == api_ret)
	{
        ret = wifi_get_ipaddress();
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		memcpy(ip_config, &g_wifi_ipconfig, sizeof(wifi_ip_configuration_t));
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}
	return api_ret;
}

/**
* @fn
* @brief Scan Access points
*/
wifi_err_t R_WIFI_SX_ULPGN_Scan (wifi_scan_result_t *ap_results, uint32_t max_networks, uint32_t *exist_ap_list)
{
    int32_t i;
    int32_t ret;
    uint8_t retry_count;
    uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;

    if ((NULL == ap_results) || (0 == max_networks) || (NULL == exist_ap_list))
    {
    	return WIFI_ERR_PARAMETER;
    }
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}
	if(WIFI_SUCCESS == api_ret)
	{
	    gp_wifi_ap_results = ap_results;
	    g_wifi_aplistmax = max_networks;
		g_wifi_aplist_stored_num = 0;
		g_wifi_aplist_count = 0;
		g_wifi_aplist_subcount = 0;
		memset(gp_wifi_ap_results,0x00,sizeof(wifi_scan_result_t)*max_networks);
		for(i=0; i<max_networks; i++)
		{
			gp_wifi_ap_results[i].security = WIFI_SECURITY_UNDEFINED;
		}
	    // TODO investigate why this never returns the full response
		for (retry_count = 0; retry_count < 5; retry_count++)
		{
			ret = wifi_execute_at_command(wifi_command_port, "ATWS\r", g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_APLIST, 0xff);
			if(ret == 0)
			{
				*exist_ap_list = g_wifi_aplist_count;
				break;
	        }
			vTaskDelay(1);
	    }
		if(retry_count >= 5)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}

	return api_ret;
}

/**
* @fn
* @brief Get Tcp Socket Status
*/
int32_t R_WIFI_SX_ULPGN_GetTcpSocketStatus(uint8_t socket_number)
{
	if(socket_number >= g_wifi_createble_sockets)
	{
	    return -1;
	}
	g_wifi_socket[socket_number].socket_status = wifi_get_socket_status(socket_number);
	return g_wifi_socket[socket_number].socket_status;
}

/**
* @fn
* @brief Create Socket
*/
int32_t    R_WIFI_SX_ULPGN_CreateSocket(uint32_t type, uint32_t ip_version)
{
	int32_t i;
	int32_t ret = WIFI_ERR_SOCKET_CREATE;
	uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;

	if(type != WIFI_SOCKET_IP_PROTOCOL_TCP || ip_version != WIFI_SOCKET_IP_VERSION_4)
	{
		return WIFI_ERR_PARAMETER;
	}
	if( 0 != R_WIFI_SX_ULPGN_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

	for(i=0;i<g_wifi_createble_sockets;i++)
	{
		if(g_wifi_socket[i].socket_create_flag == 0)
		{
			break;
		}
	}
	if (g_wifi_createble_sockets == WIFI_CFG_CREATABLE_SOCKETS )
	{
		if(i >= g_wifi_createble_sockets)
		{
			api_ret = WIFI_ERR_SOCKET_NUM;
		}
	}
	else if(g_wifi_createble_sockets < WIFI_CFG_CREATABLE_SOCKETS ) {
		if(i > g_wifi_createble_sockets)
		{
			api_ret = WIFI_ERR_SOCKET_NUM;
		}
	}
	else
	{
		api_ret = WIFI_ERR_SOCKET_NUM;
	}

	if(WIFI_SUCCESS == api_ret)
	{
		g_wifi_socket[i].socket_create_flag = 1;
		g_wifi_socket[i].ipversion = (uint8_t)ip_version;
		g_wifi_socket[i].protocol = (uint8_t)type;
		g_wifi_socket[i].socket_status = WIFI_SOCKET_STATUS_SOCKET;
		g_wifi_socket[i].ssl_flag = 0;
		g_wifi_socket[i].ssl_type = 0;
		g_wifi_socket[i].ssl_certificate_id = 0;
		R_BYTEQ_Flush(g_wifi_socket[i].socket_byteq_hdl);
		ret = i;
	}
	else
	{
		ret = WIFI_ERR_SOCKET_CREATE;
	}
	/* Give back the socketInUse mutex. */
	wifi_give_mutex(mutex_flag);

    return ret;
}

/**
* @fn
* @brief Get host by name
*/
uint32_t r_sx_ulpgn_get_host_by_name( const char * pcHostName )
{
	uint32_t ulAddr = 0;

	R_WIFI_SX_ULPGN_DnsQuery((uint8_t *)pcHostName, &ulAddr);
	return ulAddr;
}

/**
* @fn
* @brief Connect Socket
*/
wifi_err_t R_WIFI_SX_ULPGN_ConnectSocket(int32_t socket_number, uint32_t ip_address, uint16_t port,char *destination)
{
	int32_t ret;
	uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;
	uint8_t certificate_count;

	wifi_certificate_infomation_t *certificate_information;
	wifi_certificate_infomation_t cert_info;
	char  certificate_file[256];
	char  calist_file[256];
	uint8_t certificate_flg = 0;
	uint8_t calist_flg = 0;
	certificate_information = (wifi_certificate_infomation_t*)&cert_info;

	if( (0 == ip_address) || (0 == port) )
	{
		return  WIFI_ERR_PARAMETER;
	}
	if( 0 != R_WIFI_SX_ULPGN_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}
	if( (socket_number >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_number < 0) || (g_wifi_socket[socket_number].socket_status != WIFI_SOCKET_STATUS_SOCKET) )
	{
		return  WIFI_ERR_SOCKET_NUM;
	}

	if(1 == g_wifi_socket[socket_number].ssl_flag)
	{
		for (certificate_count=0;certificate_count<sizeof((WIFI_CertificateProfile_t*)certificate_profile);certificate_count++)
		{
			if (ip_address == certificate_profile[certificate_count].host_address)
			{
				g_wifi_socket[socket_number].ssl_certificate_id = certificate_count;
				break;
			}
			else if('\0'!=certificate_profile[certificate_count].host_name[0])
			{
				if(ip_address == r_sx_ulpgn_get_host_by_name(certificate_profile[certificate_count].host_name))
				{
					g_wifi_socket[socket_number].ssl_certificate_id = certificate_count;
					break;
				}
			}
		}

		api_ret = R_WIFI_SX_ULPGN_GetServerCertificate(certificate_information);
	}
	if(WIFI_SUCCESS != api_ret)
	{
		return api_ret;
	}
	mutex_flag = (MUTEX_TX | MUTEX_RX);
	if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
		return api_ret;
	}

	if(WIFI_SUCCESS == api_ret)
	{
		if(ULPGN_USE_UART_NUM == 2)
		{
			ret = wifi_change_socket_index((uint8_t)socket_number);
			if(ret != 0)
			{
				api_ret = WIFI_ERR_CHANGE_SOCKET;
			}
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		vTaskDelay(200);
		if(1 == g_wifi_socket[socket_number].ssl_flag)
		{
			sprintf((char*)certificate_file,"cert%d.crt",g_wifi_socket[socket_number].ssl_certificate_id);
			sprintf((char*)calist_file,"calist%d.crt",g_wifi_socket[socket_number].ssl_certificate_id);

