renesas/amazon-freertos/vendors/renesas/boards/rl78g14-fpb/amazon_freertos_common/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
			/* 指定ファイルが存在するかの確認　*/
			while(certificate_information->certificate_file[0]!=0)
			{
				if(0==strcmp((char*)(certificate_information->certificate_file),(char*)certificate_file))
				{
					certificate_flg = 1;
				}
				if(0==strcmp((char*)(certificate_information->certificate_file),(char*)calist_file))
				{
					calist_flg = 1;
				}
				if (1==certificate_flg & 1==calist_flg)
				{
					break;
				}
				certificate_information = certificate_information->next_certificate_name;
			}

			sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATNSOCK=%d,%d\r", 2, 4);
			ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CREATE, 0xff);
			if(ret != 0)
			{
				api_ret = WIFI_ERR_SOCKET_CREATE;
			}
			/* Receive timeout  */
			ret = wifi_execute_at_command(wifi_command_port, "ATNSSL=2,1\r", g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_AUTO_TRANSPARENT_MODE, 0xff);
			if(ret != 0)
			{
				api_ret = WIFI_ERR_MODULE_COM;
				printf("ATNSSL ERROR\r\n");
			}

			if (1==calist_flg)
			{
				sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATNSSLLD=2,%s,2\r", (char*)calist_file);
				ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_AUTO_TRANSPARENT_MODE, 0xff);
				if(ret != 0)
				{
					api_ret = WIFI_ERR_MODULE_COM;
					printf("ATNSSLLD_CA ERROR\r\n");
				}
			}
			if (1==certificate_flg)
			{
				sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATNSSLLD=2,%s,1\r", (char*)certificate_file);
			ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_AUTO_TRANSPARENT_MODE, 0xff);
			if(ret != 0)
			{
				api_ret = WIFI_ERR_MODULE_COM;
				printf("ATNSSLLS_CERT ERROR\r\n");
			}
			}
			if('\0'!=destination)
			{
				sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATNSSLCFG=2,4,%s,0,1\r", (char*)destination);
			}
			else
			{
				sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATNSSLCFG=2,4,,0,1\r");
			}
			ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_AUTO_TRANSPARENT_MODE, 0xff);
			if(ret != 0)
			{
				api_ret = WIFI_ERR_MODULE_COM;
				printf("ATNSSLCFG ERROR\r\n");
			}
		}
		else
		{
			sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATNSOCK=%d,%d\r", 0, 4);
			ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CREATE, 0xff);
			if(ret != 0)
			{
				api_ret = WIFI_ERR_SOCKET_CREATE;
			}
		}

	}

	if(WIFI_SUCCESS == api_ret)
	{
		sprintf((char *)g_wifi_uart[wifi_command_port].command_buff,"ATNCTCP=%d.%d.%d.%d,%d\r",
				WIFI_ULONG_TO_IPV4BYTE_1(ip_address), WIFI_ULONG_TO_IPV4BYTE_2(ip_address),
				WIFI_ULONG_TO_IPV4BYTE_3(ip_address), WIFI_ULONG_TO_IPV4BYTE_4(ip_address),
				port);
		if(ULPGN_USE_UART_NUM == 2)
		{
			ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, g_command_execute_timeout5, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CONNECT, socket_number);
		}
		else
		{
			ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, g_command_execute_timeout5, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CONNECT, socket_number);
		}
		if(ret != 0)
		{
			wifi_execute_at_command(wifi_command_port, "ATNCLOSE\r", g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CLOSE, socket_number);
			R_BSP_SoftwareDelay(500, BSP_DELAY_MILLISECS);
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	else
	{
		wifi_execute_at_command(wifi_command_port, "ATNCLOSE\r", g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CLOSE, socket_number);
		R_BSP_SoftwareDelay(500, BSP_DELAY_MILLISECS);
		api_ret = WIFI_ERR_MODULE_COM;
	}
	if(WIFI_SUCCESS == api_ret)
	{
		g_wifi_socket[socket_number].socket_status = WIFI_SOCKET_STATUS_CONNECTED;
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}

    return api_ret;

}

/**
* @fn
* @brief Send Socket data
*/
int32_t R_WIFI_SX_ULPGN_SendSocket (int32_t socket_number, __far uint8_t *data, int32_t length, uint32_t timeout_ms)
{
	volatile int32_t timeout;
	volatile int32_t sended_length;
    int32_t current_send_length;
    int32_t ret;
    sci_err_t ercd;
    int32_t api_ret = 0;

	if( (data == NULL) || (length < 0 ))
	{
		return  WIFI_ERR_PARAMETER;
	}

	if( 0 != R_WIFI_SX_ULPGN_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

	if( (socket_number >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_number < 0) || (0 == g_wifi_socket[socket_number].socket_create_flag) || (g_wifi_socket[socket_number].socket_status != WIFI_SOCKET_STATUS_CONNECTED) )
	{
		return  WIFI_ERR_SOCKET_NUM;
	}

    if(0 == wifi_take_mutex(MUTEX_TX))
	{
		sended_length = 0;

		if(ULPGN_USE_UART_NUM == 2)
        {
        	if(socket_number != current_socket_index)
        	{
        	    if(0 != wifi_take_mutex(MUTEX_RX))
        		{
        	    	wifi_give_mutex(MUTEX_TX);
        	    	return WIFI_ERR_TAKE_MUTEX;
        		}
                ret = wifi_change_socket_index((uint8_t)socket_number);
    	    	wifi_give_mutex(MUTEX_RX);
                if(ret != 0)
                {
                    /* Give back the socketInUse mutex. */
        	    	wifi_give_mutex(MUTEX_TX);
        	    	return WIFI_ERR_CHANGE_SOCKET;
                }
        	}
        }
		if(ULPGN_USE_UART_NUM == 1)
        {
			if(0 == g_wifi_transparent_mode)
			{
        	    if(0 != wifi_take_mutex(MUTEX_RX))
        		{
        	    	wifi_give_mutex(MUTEX_TX);
        	    	return WIFI_ERR_TAKE_MUTEX;
        		}
        	    ret = wifi_change_transparent_mode();
    	    	wifi_give_mutex(MUTEX_RX);
                if(ret != 0)
                {
                    /* Give back the socketInUse mutex. */
        	    	wifi_give_mutex(MUTEX_TX);
        	    	return WIFI_ERR_MODULE_COM;
                }
			}
        }

		if(0 != timeout_ms)
		{
			socket_timeout_init(socket_number, timeout_ms, 0);
		}

        timeout = 0;

        while(sended_length < length)
        {
            if(length - sended_length > g_wifi_tx_busiz_data)
            {
                current_send_length = g_wifi_tx_busiz_data;
            }
            else
            {
                current_send_length = length - sended_length;
            }

            if(current_send_length > WIFI_SOCKET_SENDABLE_DATASIZE)
            {
            	current_send_length = WIFI_SOCKET_SENDABLE_DATASIZE;
            }

