renesas/amazon-freertos/vendors/renesas/boards/rl78g14-fpb/amazon_freertos_common/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
}

/**
* @fn
* @brief Close Socket
*/
wifi_err_t R_WIFI_SX_ULPGN_CloseSocket(int32_t socket_number)
{
	wifi_err_t api_ret = WIFI_SUCCESS;

	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_CONNECT;
	}
	if( 0 != R_WIFI_SX_ULPGN_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}
	if((socket_number >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_number < 0))
	{
		return WIFI_ERR_SOCKET_NUM;
	}

	if(g_wifi_socket[socket_number].socket_create_flag == 1)
	{
		if (g_wifi_socket[socket_number].socket_status > WIFI_SOCKET_STATUS_SOCKET)
		{
			api_ret = R_WIFI_SX_ULPGN_ShutdownSocket  (socket_number);
		}
		R_BYTEQ_Flush(g_wifi_socket[socket_number].socket_byteq_hdl);
		g_wifi_socket[socket_number].ipversion = 0;
		g_wifi_socket[socket_number].protocol = 0;
		g_wifi_socket[socket_number].ssl_flag = 0;
		g_wifi_socket[socket_number].ssl_type = 0;
		g_wifi_socket[socket_number].ssl_certificate_id = 0;
		g_wifi_socket[socket_number].socket_status = WIFI_SOCKET_STATUS_CLOSED;
		g_wifi_socket[socket_number].socket_create_flag = 0;
    }
    return api_ret;

}

/**
* @fn
* @brief Dns Query
*/
wifi_err_t R_WIFI_SX_ULPGN_DnsQuery (const uint8_t *domain_name, uint32_t *ip_address)
{
    int32_t func_ret;
    uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;

    if ((NULL == domain_name) || (NULL == ip_address))
    {
    	return WIFI_ERR_PARAMETER;
    }
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_CONNECT;
	}
	if( 0 != R_WIFI_SX_ULPGN_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}
	if(WIFI_SUCCESS == api_ret)
	{
		g_wifi_dnsquery_subcount = 0;
		sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATNDNSQUERY=%s\r", domain_name);

		func_ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, g_command_execute_timeout4, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_DNSQUERY, 0xff);
		if(func_ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
		else
		{
			*ip_address = g_wifi_dnsaddress;
		}
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}

    return api_ret;

}


/**
* @fn
* @brief Ping
*/
wifi_err_t R_WIFI_SX_ULPGN_Ping (uint32_t ip_address, uint16_t count, uint32_t interval_ms)
{
	int32_t func_ret;
	uint8_t mutex_flag;
	uint32_t i;
	wifi_err_t api_ret = WIFI_SUCCESS;
	uint32_t success_count;

	if ((0 == ip_address) || (0 == count))
	{
		return WIFI_ERR_PARAMETER;
	}
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_CONNECT;
	}
	if( 0 != R_WIFI_SX_ULPGN_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

	if(WIFI_SUCCESS == api_ret)
	{
		success_count = 0;
		for(i=0;i<count;i++)
		{
		    mutex_flag = (MUTEX_TX | MUTEX_RX);
		    if(0 != wifi_take_mutex(mutex_flag))
			{
				api_ret = WIFI_ERR_TAKE_MUTEX;
			}
			if(WIFI_SUCCESS == api_ret)
			{
				sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATNPING=%d.%d.%d.%d\r", \
						WIFI_ULONG_TO_IPV4BYTE_1(ip_address),
						WIFI_ULONG_TO_IPV4BYTE_2(ip_address),
						WIFI_ULONG_TO_IPV4BYTE_3(ip_address),
						WIFI_ULONG_TO_IPV4BYTE_4(ip_address));
				func_ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, g_command_execute_timeout3, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_PING, 0xff);
				if(func_ret != 0)
				{
				}
				else
				{
					success_count++;
				}
			}
			if(WIFI_ERR_TAKE_MUTEX != api_ret)
			{
				wifi_give_mutex(mutex_flag);
			}
			if((i+1) < count)
			{
				vTaskDelay(interval_ms);
			}
		}
	}
	if(success_count == 0)
	{
		if(WIFI_ERR_TAKE_MUTEX!=api_ret)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	return api_ret;

}

/**
* @fn
* @brief Get Version
*/
uint32_t R_WIFI_SX_ULPGN_GetVersion(void)
{
    /* These version macros are defined in r_wifi_sx_ulpgn_if.h. */
    return ((((uint32_t)WIFI_SX_ULPGN_VERSION_MAJOR) << 16) | (uint32_t)WIFI_SX_ULPGN_VERSION_MINOR);
}

/**
* @fn
* @brief Get Ip Address
*/
static int32_t wifi_get_ipaddress(void)
{

    int32_t func_ret;

    func_ret = wifi_execute_at_command(wifi_command_port, "ATNSET=\?\r", g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_IPADDRESS, 0xff);
    if(func_ret != 0)
    {
        return -1;
    }
    return 0;
}


/**
* @fn
* @brief Get Socket Status
*/
static int32_t wifi_get_socket_status(uint8_t socket_number)
{
    int32_t ret;

	ret = wifi_execute_at_command(wifi_command_port, "ATNSTAT\r", g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_SOCKET_STATUS, socket_number);
    if(ret != 0)
    {
        return -1;
    }

    if(g_wifi_socket_status < ULPGN_SOCKET_STATUS_MAX)
    {
    	return g_wifi_socket_status;
    }
    else
    {
    	return -1;
    }
}

/**
* @fn
* @brief Chnage to transparent mode
*/
static int32_t wifi_change_transparent_mode(void)
{
    int32_t ret;

    if((ULPGN_USE_UART_NUM == 1) && (g_wifi_transparent_mode == 0) )
    {
		ret = wifi_execute_at_command(wifi_command_port, "ATO\r", g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_TRANSPARENT_MODE, 0xff);
		if(ret != 0)
		{
			return -1;
		}
		else
		{
			g_wifi_transparent_mode = 1;
		}
    }
    return 0;
}

/**
* @fn
* @brief Change command mode
*/
static int32_t wifi_change_command_mode(void)
{
	int32_t ret;
    if((ULPGN_USE_UART_NUM == 1) && (g_wifi_transparent_mode == 1) )
    {
        R_BSP_SoftwareDelay(202, BSP_DELAY_MILLISECS);
        g_wifi_transparent_mode = 0;
    	ret = wifi_execute_at_command(wifi_command_port, "+++", g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_COMMAND_MODE, 0xff);
    	if(ret == 0)
    	{
            R_BSP_SoftwareDelay(202, BSP_DELAY_MILLISECS);
    	}
    	else
    	{
    		return -1;
    	}
    }
    return 0;
}


/**
* @fn
* @brief cgange socket index
*/
static int32_t wifi_change_socket_index(uint8_t socket_number)
{
    volatile int32_t timeout;
    int32_t ret = 0;
    uint16_t i;
    uint16_t stored_data_size = 0;
    uint32_t previous_socket_store_data_size = 0;
    uint16_t read_data_size;
    uint8_t before_socket_number;
    uint8_t temprary_buff[64];

    uint32_t previous_atustat_sent,now_atustat_sent,atustat_recv;
    uint8_t sequence;
    uint8_t zero_cnt;
    uint32_t ipl;

    if(ULPGN_USE_UART_NUM == 2)
    {
      	if(socket_number != current_socket_index)
        {
    		sequence = 0;
            before_socket_number = current_socket_index;
            stored_data_size = 0;
            zero_cnt = 0;

