renesas/amazon-freertos/vendors/renesas/boards/rl78g14-fpb/amazon_freertos_common/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
            sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATNSOCKINDEX=%d\r", socket_number);

            ret = wifi_check_uart_state(&atustat_recv, &previous_atustat_sent);
            if(ret != 0)
            {
            	return -1;
            }
			R_BSP_SoftwareDelay(ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_VALUE, ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_PERIOD);

            while(sequence < 0x80)
            {
            	switch(sequence)
            	{
            		case 0:
            			/* Read the remaining data three times and proceed to the next step without data. */
                        /* Enable temporary byte que(default byte que). */
                        g_temporary_byteq_enable_flag = 1;
                        ret = wifi_check_uart_state(&atustat_recv, &now_atustat_sent);
                        if(ret != 0)
                        {
							ret = -1;
							sequence = 0x80;
							break;
                        }

                        do{

        					if(SCI_SUCCESS != R_SCI_Control(g_wifi_uart[wifi_data_port].wifi_uart_sci_handle, SCI_CMD_RX_Q_BYTES_AVAIL_TO_READ, &stored_data_size))
        					{
    							ret = -1;
    							sequence = 0x80;
    							break;
        					}
        					if(stored_data_size > 0)
        					{
        						zero_cnt = 0;
        						if(sizeof(temprary_buff) >= stored_data_size)
            					{
            						read_data_size = stored_data_size;
            					}
            					else
            					{
            						read_data_size = sizeof(temprary_buff);
            					}

            					R_SCI_Receive(g_wifi_uart[wifi_data_port].wifi_uart_sci_handle, temprary_buff, read_data_size);

            					for(i = 0; i < read_data_size; i++ )
            					{
            						if(BYTEQ_SUCCESS != R_BYTEQ_Put(g_wifi_socket[current_socket_index].socket_byteq_hdl, *(temprary_buff + i)))
									{
            			                g_wifi_socket[current_socket_index].put_error_count++;
									}
            					}

            					stored_data_size -= read_data_size;
        					}
        					else
        					{
        					}
        				}while(stored_data_size > 0);
                        if(now_atustat_sent == previous_atustat_sent)
                        {
    						zero_cnt++;
                        }
                        else
                        {
    						zero_cnt = 0;
                        }
                        previous_atustat_sent = now_atustat_sent;
            			if(zero_cnt < 2)
            			{
        					R_BSP_SoftwareDelay(ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_VALUE, ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_PERIOD);
            				sequence = 0;
            			}
            			else
            			{
        					R_BSP_SoftwareDelay(ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_VALUE, ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_PERIOD);
        					zero_cnt = 0;
            				sequence = 2;
            			}
            			break;
            		case 2:

                        timeout = 0;
                        g_wifi_uart[wifi_command_port].tx_end_flag = 0;
                        /* Send ATNSOCKINDEX command. */

                        g_sockindex_command_flag =1;
            			ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CHANGE, socket_number);
                    	g_sockindex_command_flag =0;
                        if(-1 == ret)
                        {
							ret = -1;
							sequence = 0x80;
							break;
                        }

                        /* Parse command return code. */
						switch(ret)
						{
							case 0:
								/* change socket index to next. */
								current_socket_index = socket_number;

								ret = wifi_check_uart_state(&atustat_recv, &now_atustat_sent);
								if(ret != 0)
								{
									ret = -1;
									sequence = 0x80;
									break;
								}

	                            if((now_atustat_sent - previous_atustat_sent) > 0)
								{
										previous_socket_store_data_size = now_atustat_sent - previous_atustat_sent;
#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
								        WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 0;
#elif defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
									    WIFI_CFG_UART_DEFAULT_SCI_RTS_PODR = 0;
#endif
										/* Copy data(which stored during socket switching) from temporary buff to current socket buff. */
										while(previous_socket_store_data_size > 0)
										{
											if(SCI_SUCCESS != R_SCI_Control(g_wifi_uart[wifi_data_port].wifi_uart_sci_handle,
													SCI_CMD_RX_Q_BYTES_AVAIL_TO_READ, &stored_data_size))
											{
												ret = -1;
												sequence = 0x80;
												break;
											}
											if(stored_data_size > 0)
											{
												if(sizeof(temprary_buff) >= stored_data_size)
												{
													read_data_size = stored_data_size;
												}
												else
												{
													read_data_size = sizeof(temprary_buff);
												}

												if(read_data_size > previous_socket_store_data_size)
												{
													read_data_size = previous_socket_store_data_size;
												}
												if(SCI_SUCCESS != R_SCI_Receive(g_wifi_uart[wifi_data_port].wifi_uart_sci_handle,
														 temprary_buff, read_data_size))
												{
													ret = -1;
													sequence = 0x80;
													break;
												}
												else
												{
													for(i = 0; i < read_data_size; i++ )
													{
														if(BYTEQ_SUCCESS != R_BYTEQ_Put(g_wifi_socket[before_socket_number].socket_byteq_hdl, *(temprary_buff + i)))
														{
															g_wifi_socket[before_socket_number].put_error_count++;
														}
													}
													previous_socket_store_data_size -= read_data_size;
												}
											}
										}
								}
								else
								{
#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
							        WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 0;
#elif defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
									WIFI_CFG_UART_DEFAULT_SCI_RTS_PODR = 0;
#endif
								}
								/* Copy data(which stored during socket switching) from temporary buff to next socket buff. */
								do{

