renesas/amazon-freertos/vendors/renesas/boards/rl78g14-fpb/amazon_freertos_common/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
									if(SCI_SUCCESS != R_SCI_Control(g_wifi_uart[wifi_data_port].wifi_uart_sci_handle,  SCI_CMD_RX_Q_BYTES_AVAIL_TO_READ, &stored_data_size))
									{
										ret = -1;
										break;
									}
									if(sizeof(temprary_buff) >= stored_data_size)
									{
										read_data_size = stored_data_size;
									}
									else
									{
										read_data_size = sizeof(temprary_buff);
									}

									R_SCI_Receive(g_wifi_uart[wifi_data_port].wifi_uart_sci_handle,
											temprary_buff, read_data_size);

									for(i = 0; i < read_data_size; i++ )
									{
										R_BYTEQ_Put(g_wifi_socket[current_socket_index].socket_byteq_hdl, *(temprary_buff + i));
									}

									stored_data_size -= read_data_size;

								}while(stored_data_size > 0);
								/* Disable temporary byte que(default byte que). */

								g_temporary_byteq_enable_flag = 0;
								ret = 0;
								sequence = 0x80;
								break;
							case -2:  /* BUSY */
								/* If dont change socket because of wifi module busy, copy data from temporary buff to socket buff
								 * and retry change socket command. */

#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
						        WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 0;
#elif defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
								WIFI_CFG_UART_DEFAULT_SCI_RTS_PODR = 0;
#endif
								/* Wait 100us for module to complete send data. */
#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
								R_BSP_SoftwareDelay(100, BSP_DELAY_MICROSECS);
						        WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 1;
#elif defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
								vTaskDelay(1); /* wait for 1ms */
								WIFI_CFG_UART_DEFAULT_SCI_RTS_PODR = 1;
#endif

								/* Copy data(which stored during socket switching) from temporary buff to current socekt buff. */
								do{

									if(SCI_SUCCESS != R_SCI_Control(g_wifi_uart[wifi_data_port].wifi_uart_sci_handle,
											 SCI_CMD_RX_Q_BYTES_AVAIL_TO_READ, &stored_data_size))
									{
										ret = -1;
										sequence = 0x80;
									}
									if(stored_data_size > 0)
									{
										if(sizeof(temprary_buff) >= stored_data_size)
										{
											read_data_size = stored_data_size;
										}
										else
										{
											read_data_size = sizeof(temprary_buff);
										}

										R_SCI_Receive(g_wifi_uart[wifi_data_port].wifi_uart_sci_handle,
												 temprary_buff, read_data_size);

										for(i = 0; i < read_data_size; i++ )
										{
											if(BYTEQ_SUCCESS != R_BYTEQ_Put(g_wifi_socket[current_socket_index].socket_byteq_hdl, *(temprary_buff + i)))
											{
												g_wifi_socket[current_socket_index].put_error_count++;
											}
										}

										stored_data_size -= read_data_size;
									}
								}while(stored_data_size > 0);
								sequence = 0;
								break;
							default:
								/* This is command error and recovery socket status. */
								ret = -1;
								sequence = 0x80;
								break;
                    	}
            			break;
            	}
            }
            
			if(-1 == ret)
			{
				ipl = R_BSP_CpuInterruptLevelRead();
				R_BSP_CpuInterruptLevelWrite (WIFI_CFG_SCI_INTERRUPT_LEVEL);

				/* Copy data(which stored during socket switching) from temporary buff to current socket buff. */
				do{						

					if(SCI_SUCCESS != R_SCI_Control(g_wifi_uart[wifi_data_port].wifi_uart_sci_handle,
							SCI_CMD_RX_Q_BYTES_AVAIL_TO_READ, &stored_data_size))
					{
						break;
					}
					if(stored_data_size > 0)
					{
						if(sizeof(temprary_buff) >= stored_data_size)
						{
							read_data_size = stored_data_size;
						}
						else
						{
							read_data_size = sizeof(temprary_buff);
						}

						R_SCI_Receive(g_wifi_uart[wifi_data_port].wifi_uart_sci_handle,
								temprary_buff, read_data_size);

						for(i = 0; i < read_data_size; i++ )
						{
							if(BYTEQ_SUCCESS != R_BYTEQ_Put(g_wifi_socket[current_socket_index].socket_byteq_hdl, *(temprary_buff + i)))
							{
								g_wifi_socket[current_socket_index].put_error_count++;
							}
						}
						stored_data_size -= read_data_size;
					}
				}while(stored_data_size > 0);
				
				/* Disable temporary byte que(default byte que). */
				g_temporary_byteq_enable_flag = 0;
#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
		        WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 0;
#elif defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
				WIFI_CFG_UART_DEFAULT_SCI_RTS_PODR = 0;
#endif

				R_BSP_CpuInterruptLevelWrite (ipl);
				
			}
            
        }
    
    }
    
    return ret;
}

/**
* @fn
* @brief check uart status
*/
static int32_t wifi_check_uart_state(uint32_t *uart_receive_status, uint32_t *uart_send_status)
{
#if DEBUGLOG == 1
    TickType_t tmptime1, tmptime2;
#endif

    uint8_t retry_count;
    int32_t ret;

	for (retry_count = 0; retry_count < 10; retry_count++)
    {
		ret = wifi_execute_at_command(wifi_command_port, "ATUSTAT\r", g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_SENT_RECV_SIZE, 0xff);
		if(ret == 0)
		{
			*uart_receive_status = g_wifi_atustat_recv;
			*uart_send_status = g_wifi_atustat_sent;
			return 0;
		}
		if(ret == -1)
		{
			return -1;
		}
		if(ret == -2)
		{
			continue;
		}
    }
	return -1;
}

/**
* @fn
* @brief wifi Serial open for initial channel
*/
static int32_t wifi_serial_open_for_initial(void)
{
    sci_err_t   my_sci_err;

#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
    R_SCI_PinSet_wifi_serial_default();
#endif

    memset(&g_wifi_uart[ULPGN_UART_DEFAULT_PORT].wifi_uart_sci_handle, 0, sizeof(sci_hdl_t));
	g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.baud_rate    = WIFI_UART_BAUDRATE_DEFAULT;
	g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.clk_src      = SCI_CLK_INT;
	g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.data_size    = SCI_DATA_8BIT;
	g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.parity_en    = SCI_PARITY_OFF;
	g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.parity_type  = SCI_EVEN_PARITY;
	g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.stop_bits    = SCI_STOPBITS_1;
	g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config.async.int_priority = WIFI_CFG_SCI_INTERRUPT_LEVEL;    // 1=lowest, 15=highest

    my_sci_err = R_SCI_Open(SCI_CH_wifi_serial_default, SCI_MODE_ASYNC, &g_wifi_uart[WIFI_UART_COMMAND_PORT].sci_config, wifi_uart_callback_default_port_for_inititial, &g_wifi_uart[WIFI_UART_COMMAND_PORT].wifi_uart_sci_handle);
    if(SCI_SUCCESS != my_sci_err)
    {
        return -1;
    }

