renesas/amazon-freertos/vendors/renesas/boards/rl78g14-fpb/amazon_freertos_common/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
    return 0;

}

/**
* @fn
* @brief wifi Serial open for data channel
*/
static int32_t wifi_serial_open_for_data(void)
{
    sci_err_t   my_sci_err;
    uint8_t level;

#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
    R_SCI_PinSet_wifi_serial_default();
#endif

    memset(&g_wifi_uart[ULPGN_UART_DEFAULT_PORT].wifi_uart_sci_handle, 0, sizeof(sci_hdl_t));
    g_wifi_uart[ULPGN_UART_DEFAULT_PORT].sci_config.async.baud_rate    = WIFI_CFG_SCI_BAUDRATE;
    g_wifi_uart[ULPGN_UART_DEFAULT_PORT].sci_config.async.clk_src      = SCI_CLK_INT;
    g_wifi_uart[ULPGN_UART_DEFAULT_PORT].sci_config.async.data_size    = SCI_DATA_8BIT;
    g_wifi_uart[ULPGN_UART_DEFAULT_PORT].sci_config.async.parity_en    = SCI_PARITY_OFF;
    g_wifi_uart[ULPGN_UART_DEFAULT_PORT].sci_config.async.parity_type  = SCI_EVEN_PARITY;
    g_wifi_uart[ULPGN_UART_DEFAULT_PORT].sci_config.async.stop_bits    = SCI_STOPBITS_1;
    g_wifi_uart[ULPGN_UART_DEFAULT_PORT].sci_config.async.int_priority = WIFI_CFG_SCI_INTERRUPT_LEVEL;    // 1=lowest, 15=highest

    my_sci_err = R_SCI_Open(SCI_CH_wifi_serial_default, SCI_MODE_ASYNC, &g_wifi_uart[ULPGN_UART_DEFAULT_PORT].sci_config, wifi_uart_callback_default_port_for_data, &g_wifi_uart[ULPGN_UART_DEFAULT_PORT].wifi_uart_sci_handle);

    if(SCI_SUCCESS != my_sci_err)
    {
        return -1;
    }

#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
    level = g_wifi_uart[ULPGN_UART_DEFAULT_PORT].sci_config.async.int_priority -1;
    my_sci_err = R_SCI_Control(g_wifi_uart[ULPGN_UART_DEFAULT_PORT].wifi_uart_sci_handle, SCI_CMD_SET_TXI_PRIORITY,&level);
    if(SCI_SUCCESS != my_sci_err)
    {
        return -1;
    }
#endif

    return 0;

}


/**
* @fn
* @brief wifi Serial open for second channel
*/
static int32_t wifi_serial_second_port_open(void)
{
    sci_err_t   my_sci_err;

#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
    R_SCI_PinSet_wifi_serial_second();
#endif

    memset(&g_wifi_uart[ULPGN_UART_SECOND_PORT].wifi_uart_sci_handle, 0, sizeof(sci_hdl_t));
    g_wifi_uart[ULPGN_UART_SECOND_PORT].sci_config.async.baud_rate    = 115200;
    g_wifi_uart[ULPGN_UART_SECOND_PORT].sci_config.async.clk_src      = SCI_CLK_INT;
    g_wifi_uart[ULPGN_UART_SECOND_PORT].sci_config.async.data_size    = SCI_DATA_8BIT;
    g_wifi_uart[ULPGN_UART_SECOND_PORT].sci_config.async.parity_en    = SCI_PARITY_OFF;
    g_wifi_uart[ULPGN_UART_SECOND_PORT].sci_config.async.parity_type  = SCI_EVEN_PARITY;
    g_wifi_uart[ULPGN_UART_SECOND_PORT].sci_config.async.stop_bits    = SCI_STOPBITS_1;
    g_wifi_uart[ULPGN_UART_SECOND_PORT].sci_config.async.int_priority = WIFI_CFG_SCI_INTERRUPT_LEVEL;    // 1=lowest, 15=highest

    my_sci_err = R_SCI_Open(SCI_CH_wifi_serial_second, SCI_MODE_ASYNC, &g_wifi_uart[ULPGN_UART_SECOND_PORT].sci_config, wifi_uart_callback_second_port_for_command, &g_wifi_uart[ULPGN_UART_SECOND_PORT].wifi_uart_sci_handle);

    if(SCI_SUCCESS != my_sci_err)
    {
        return -1;
    }

    return 0;
}


/**
* @fn
* @brief Close wifi Serial channel
*/
static int32_t wifi_serial_close(void)
{
	wifi_serial_default_port_close();
    if(ULPGN_USE_UART_NUM == 2)
    {
    	wifi_serial_second_port_close();
    }
    return 0;
}

/**
* @fn
* @brief Close wifi Serial default channel
*/
static int32_t wifi_serial_default_port_close(void)
{
    R_SCI_Control(g_wifi_uart[ULPGN_UART_DEFAULT_PORT].wifi_uart_sci_handle,  SCI_CMD_RX_Q_FLUSH, NULL);
    R_SCI_Control(g_wifi_uart[ULPGN_UART_DEFAULT_PORT].wifi_uart_sci_handle, SCI_CMD_TX_Q_FLUSH, NULL);
    R_SCI_Close(g_wifi_uart[ULPGN_UART_DEFAULT_PORT].wifi_uart_sci_handle);

    return 0;
}

/**
* @fn
* @brief Close wifi Serial second channel
*/
static int32_t wifi_serial_second_port_close(void)
{
    R_SCI_Control(g_wifi_uart[ULPGN_UART_SECOND_PORT].wifi_uart_sci_handle, SCI_CMD_RX_Q_FLUSH, NULL);
    R_SCI_Control(g_wifi_uart[ULPGN_UART_SECOND_PORT].wifi_uart_sci_handle, SCI_CMD_TX_Q_FLUSH, NULL);
    R_SCI_Close(g_wifi_uart[ULPGN_UART_SECOND_PORT].wifi_uart_sci_handle);
    return 0;
}

/**
* @fn
* @brief callback for wifi Serial initial channel
*/
static void wifi_uart_callback_default_port_for_inititial(void *pArgs)
{
    sci_cb_args_t   *p_args;

    p_args = (sci_cb_args_t *)pArgs;
    if (SCI_EVT_RX_CHAR == p_args->event)
    {
        /* From RXI interrupt; received character data is in p_args->byte */
        R_BSP_NOP();
    }
#if SCI_CFG_TEI_INCLUDED
    else if (SCI_EVT_TEI == p_args->event)
    {
    	g_wifi_uart[ULPGN_UART_DEFAULT_PORT].tx_end_flag = 1;
    }
#endif
    else if (SCI_EVT_RXBUF_OVFL == p_args->event)
    {
        /* From RXI interrupt; rx queue is full; 'lost' data is in p_args->byte
           You will need to increase buffer size or reduce baud rate */
    	g_wifi_sci_err_flag = 1;
    }
    else if (SCI_EVT_OVFL_ERR == p_args->event)
    {
        /* From receiver overflow error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
    	g_wifi_sci_err_flag = 2;
    }
    else if (SCI_EVT_FRAMING_ERR == p_args->event)
    {
        /* From receiver framing error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
    	g_wifi_sci_err_flag = 3;
    }
    else if (SCI_EVT_PARITY_ERR == p_args->event)
    {
        /* From receiver parity error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
    }
    else
    {
        /* Do nothing */
    }

} /* End of function my_sci_callback() */



/**
* @fn
* @brief callback for wifi Serial command channel
*/
static void wifi_uart_callback_second_port_for_command(void *pArgs)
{
    sci_cb_args_t   *p_args;

    p_args = (sci_cb_args_t *)pArgs;
    if (SCI_EVT_RX_CHAR == p_args->event)
    {
        /* From RXI interrupt; received character data is in p_args->byte */
        R_BSP_NOP();
    }
#if SCI_CFG_TEI_INCLUDED
    else if (SCI_EVT_TEI == p_args->event)
    {
    	g_wifi_uart[ULPGN_UART_SECOND_PORT].tx_end_flag = 1;
        if(g_sockindex_command_flag == 1)
        {
#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
	        WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 1;
#elif defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
            WIFI_CFG_UART_DEFAULT_SCI_RTS_PODR = 1;
#endif
        }
    }
#endif
    else if (SCI_EVT_RXBUF_OVFL == p_args->event)
    {
        /* From RXI interrupt; rx queue is full; 'lost' data is in p_args->byte
           You will need to increase buffer size or reduce baud rate */
    	g_wifi_sci_err_flag = 1;
    }
    else if (SCI_EVT_OVFL_ERR == p_args->event)
    {
        /* From receiver overflow error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
    	g_wifi_sci_err_flag = 2;
    }
    else if (SCI_EVT_FRAMING_ERR == p_args->event)
    {
        /* From receiver framing error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
    	g_wifi_sci_err_flag = 3;
    }
    else if (SCI_EVT_PARITY_ERR == p_args->event)
    {
        /* From receiver parity error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
    }
    else
    {
        /* Do nothing */
    }
} /* End of function my_sci_callback() */

/**
* @fn
* @brief callback for wifi Serial data channel
*/
static void wifi_uart_callback_default_port_for_data(void *pArgs)
{
    sci_cb_args_t   *p_args;
    byteq_err_t byteq_ret;

    p_args = (sci_cb_args_t *)pArgs;

    if (SCI_EVT_RX_CHAR == p_args->event)
    {
        if((0 == g_temporary_byteq_enable_flag)&&(g_wifi_socket[current_socket_index].socket_create_flag == 1))
        {
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
            if (g_wifi_socket[current_socket_index].socket_status == ULPGN_SOCKET_STATUS_CONNECTED)
            {
                uint16_t byteq_free = 0;
                R_BYTEQ_Unused(g_wifi_socket[current_socket_index].socket_byteq_hdl, &byteq_free);
                if (WIFI_CFG_SOCKETS_RECEIVE_BUFFER_THRESHOLD >= byteq_free)
                {
                    WIFI_CFG_UART_DEFAULT_SCI_RTS_PODR = 1;
                }
            }
#endif
            /* From RXI interrupt; received character data is in p_args->byte */
            R_SCI_Control(g_wifi_uart[ULPGN_UART_DEFAULT_PORT].wifi_uart_sci_handle, SCI_CMD_RX_Q_FLUSH, NULL);
            byteq_ret = R_BYTEQ_Put(g_wifi_socket[current_socket_index].socket_byteq_hdl, p_args->byte);

            if (BYTEQ_SUCCESS != byteq_ret)
            {
                g_wifi_socket[current_socket_index].put_error_count++;
                return;
            }
            else
            {
            }
        }
        else
        {
//        	g_wifi_socket[current_socket_index].socket_not_create_recv_count= p_args->byte;
        }
    }
#if SCI_CFG_TEI_INCLUDED
    else if (SCI_EVT_TEI == p_args->event)
    {
    	g_wifi_uart[ULPGN_UART_DEFAULT_PORT].tx_end_flag = 1;
    }
#endif
    else if (SCI_EVT_RXBUF_OVFL == p_args->event)
    {
        /* From RXI interrupt; rx queue is full; 'lost' data is in p_args->byte
           You will need to increase buffer size or reduce baud rate */
    	g_wifi_sci_err_flag = 1;
    }
    else if (SCI_EVT_OVFL_ERR == p_args->event)
    {
        /* From receiver overflow error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
    	g_wifi_sci_err_flag = 2;
    }
    else if (SCI_EVT_FRAMING_ERR == p_args->event)
    {
        /* From receiver framing error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
    	g_wifi_sci_err_flag = 3;
    }
    else if (SCI_EVT_PARITY_ERR == p_args->event)
    {
        /* From receiver parity error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
    }
    else
    {
        /* Do nothing */
    }

} /* End of function my_sci_callback() */


/**
* @fn
* @brief execute command for AT Command
*/
static int32_t wifi_execute_at_command(uint8_t serial_ch_id, const uint8_t *ptextstring, uint16_t timeout_ms, wifi_return_code_t expect_code,  wifi_command_list_t command, int32_t socket_number)
{
	volatile int32_t timeout;
	sci_err_t ercd;
	int8_t  get_queue;
	uint32_t recvcnt = 0;
	int32_t ret;
	wifi_return_code_t result;
	uint32_t ticket_no;

    uint8_t at_buff[WIFI_AT_COMMAND_BUFF_SIZE];

