renesas/amazon-freertos/vendors/renesas/boards/rl78g14-fpb/amazon_freertos_common/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
	timeout_init(serial_ch_id, timeout_ms);

	if(ptextstring != NULL)
	{
		timeout = 0;
		recvcnt = 0;
#if DEBUGLOG == 2
		R_BSP_CpuInterruptLevelWrite (WIFI_CFG_SCI_INTERRUPT_LEVEL-1);
		printf("%s\r\n",ptextstring);
		R_BSP_CpuInterruptLevelWrite (0);
#endif

		ticket_no = wifi_set_request_in_queue( command, socket_number );
		g_wifi_uart[serial_ch_id].tx_end_flag = 0;
#if defined(__CCRX__) || defined(__ICCRX__) || defined (__RX__)
		ercd = R_SCI_Send(g_wifi_uart[serial_ch_id].wifi_uart_sci_handle, ptextstring, strlen((const char *)ptextstring));
#elif(__CCRL__)
        strcpy((char *)at_buff, (const char *)ptextstring);
        ercd = R_SCI_Send(g_wifi_uart[serial_ch_id].wifi_uart_sci_handle, at_buff, strlen((const char *)at_buff));
#endif
		if(SCI_SUCCESS != ercd)
		{
			return -1;

		}

		while(1)
		{
			if(0 != g_wifi_uart[serial_ch_id].tx_end_flag)
			{
				break;
			}
			if(-1 == check_timeout((uint32_t)serial_ch_id, recvcnt))
			{
				wifi_set_result_to_current_running_queue( WIFI_RETURN_ENUM_INTERNAL_TIMEOUT );
				timeout = 1;
				break;
			}
			vTaskDelay(1);
		}
		if(timeout == 1)
		{
			return -1;
		}
	}
	else
	{
		ticket_no = wifi_set_request_in_queue( command, socket_number );
	}
	while(1)
	{
		get_queue = wifi_get_result_from_queue( ticket_no, &result );
		if(0 == get_queue )
		{
			break;
		}

		if(-1 == check_timeout((uint32_t)serial_ch_id, recvcnt))
		{
			wifi_set_result_to_current_running_queue( WIFI_RETURN_ENUM_INTERNAL_TIMEOUT );
			timeout = 1;
			break;
		}
		vTaskDelay(1);
	}
	if(timeout == 1)
	{
		return -1;
	}
	if(result == expect_code)
	{
		ret = 0;
	}
	else if(result == WIFI_RETURN_ENUM_BUSY)
	{
		ret = -2;
	}
	return ret;
}


/**
* @fn
* @brief initialize timeout setting
*/
static void timeout_init(int32_t serial_ch, uint16_t timeout_ms)
{
	wifi_at_communication_info_t *puart;
	puart = &g_wifi_uart[serial_ch];

	puart->starttime = xTaskGetTickCount();
	puart->endtime = puart->starttime + timeout_ms;
	if(puart->endtime < puart->starttime)
	{
		/* endtime value is overflow */
		puart->timeout_overflow_flag = 1;
	}
	else
	{
		puart->timeout_overflow_flag = 0;
	}
}

/**
* @fn
* @brief Check timeout
*/
static int32_t check_timeout(int32_t serial_ch, int32_t rcvcount)
{
	wifi_at_communication_info_t *puart;
	puart = &g_wifi_uart[serial_ch];

	if(0 == rcvcount)
	{
		puart->thistime = xTaskGetTickCount();
		if(puart->timeout_overflow_flag == 0)
		{
			if(puart->thistime >= puart->endtime || puart->thistime < puart->starttime)
			{
				/* Timeout  */
				return -1;
			}
		}
		else
		{
			if(puart->thistime < puart->starttime && puart->thistime >= puart->endtime)
			{
				/* Timeout  */
				return -1;
			}
		}
	}
	/* Not timeout  */
	return 0;
}

#if 0
static void bytetimeout_init(int32_t serial_ch, uint16_t timeout_ms)
{
	wifi_at_communication_info_t *puart;
	puart = &g_wifi_uart[serial_ch];

	puart->startbytetime = xTaskGetTickCount();
	puart->endbytetime = puart->startbytetime + timeout_ms;
	if(puart->endbytetime < puart->startbytetime)
	{
		/* overflow */
		puart->byte_timeout_overflow_flag = 1;
	}
	else
	{
		puart->byte_timeout_overflow_flag = 0;
	}
}
#endif
#if 0
static int32_t check_bytetimeout(int32_t serial_ch, int32_t rcvcount)
{
	wifi_at_communication_info_t *puart;
	puart = &g_wifi_uart[serial_ch];

	if(0 != rcvcount)
	{
		puart->thisbytetime = xTaskGetTickCount();
		if(puart->byte_timeout_overflow_flag == 0)
		{
			if(puart->thisbytetime >= puart->endbytetime || puart->thisbytetime < puart->startbytetime)
			{
				return -1;
			}
		}
		else
		{
			if(puart->thisbytetime < puart->startbytetime && puart->thisbytetime >= puart->endbytetime)
			{
				/* Timeout  */
				return -1;
			}
		}
	}
	/* Not timeout  */
	return 0;
}
#endif

/**
* @fn
* @brief Initialize Socket timeout Setting
*/
static void socket_timeout_init(uint8_t socket_number, uint32_t timeout_ms, uint8_t flag)
{
	TickType_t *starttime;
	TickType_t *endtime;
	uint8_t    *timeout_overflow_flag;

	wifi_socket_t *psocket;
	psocket = &g_wifi_socket[socket_number];

	if(0 == flag)
	{
		starttime             = &psocket->send_starttime ;
//		thistime              = &psocket->send_thistime ;
		endtime               = &psocket->send_endtime ;
		timeout_overflow_flag = &psocket->send_timeout_overflow_flag;
	}
	else
	{
		starttime             = &psocket->recv_starttime ;
//		thistime              = &psocket->recv_thistime ;
		endtime               = &psocket->recv_endtime ;
		timeout_overflow_flag = &psocket->recv_timeout_overflow_flag;
	}
    *starttime = xTaskGetTickCount();
    *endtime = *starttime + timeout_ms;
    if(*endtime < *starttime)
    {
        /* overflow */
        *timeout_overflow_flag = 1;
    }
    else
    {
        *timeout_overflow_flag = 0;
    }

}

/**
* @fn
* @brief Check Socket timeout
*/
static int32_t socket_check_timeout(uint8_t socket_number, uint8_t flag)
{
	TickType_t *starttime;
	TickType_t *thistime;
	TickType_t *endtime;
	uint8_t    *timeout_overflow_flag;
	wifi_socket_t *psocket;

	psocket = &g_wifi_socket[socket_number];
	if(0 == flag)
	{
		starttime             = &psocket->send_starttime ;
		thistime              = &psocket->send_thistime ;
		endtime               = &psocket->send_endtime ;
		timeout_overflow_flag = &psocket->send_timeout_overflow_flag;
	}
	else
	{
		starttime             = &psocket->recv_starttime ;
		thistime              = &psocket->recv_thistime ;
		endtime               = &psocket->recv_endtime ;
		timeout_overflow_flag = &psocket->recv_timeout_overflow_flag;
	}

	*thistime = xTaskGetTickCount();
    if(*timeout_overflow_flag == 0)
    {
        if(*thistime >= *endtime || *thistime < *starttime)
        {
            return -1;
        }
    }
    else
    {
        if(*thistime < *starttime && *thistime <= *endtime)
        {
            /* Not timeout  */
            return -1;
        }
    }
    /* Not timeout  */
    return 0;
}

/**
* @fn
* @brief Take Wifi mutex
*/
static int32_t wifi_take_mutex(uint8_t mutex_flag)
{
    if(0 != (mutex_flag & MUTEX_TX))
    {
        if( xSemaphoreTake( g_wifi_tx_semaphore, xMaxSemaphoreBlockTime ) != pdTRUE )
        {
            vTaskDelay(1);
            return -1;
        }
    }

    if(0 != (mutex_flag & MUTEX_RX))
    {
        if( xSemaphoreTake( g_wifi_rx_semaphore, xMaxSemaphoreBlockTime ) != pdTRUE )
        {
            if(0 != (mutex_flag & MUTEX_TX))
            {
                xSemaphoreGive( g_wifi_tx_semaphore );
            }
            vTaskDelay(1);
            return -1;
        }
    }
#if DEBUGLOG ==2
	printf("Semaphore Get \n\n");
#endif
    vTaskDelay(1);
    return 0;
}

/**
* @fn
* @brief Give Wifi mutex
*/
static void wifi_give_mutex(uint8_t mutex_flag)
{
	if(0 != (mutex_flag & MUTEX_RX))
	{
		xSemaphoreGive( g_wifi_rx_semaphore);
	}
	if(0 != (mutex_flag & MUTEX_TX))
	{
		xSemaphoreGive( g_wifi_tx_semaphore);
	}
#if DEBUGLOG ==2
	printf("Semaphore Give\r\n");
#endif
    vTaskDelay(1);
	return;
}

sci_err_t ercd;

/**
* @fn
* @brief Register Server Certificate to the Wifi module
*/
wifi_err_t R_WIFI_SX_ULPGN_RegistServerCertificate (uint32_t data_id, uint32_t datatype, const uint8_t *pdata, int32_t length, uint32_t timeout_ms)
{
	volatile int32_t timeout;
	volatile int32_t sended_length;
	int32_t current_send_length;
	wifi_err_t api_ret = WIFI_SUCCESS;
//	sci_err_t ercd;
	int8_t get_queue;
	wifi_return_code_t result;
	uint8_t mutex_flag;
	uint32_t ticket_no;

