renesas/amazon-freertos/vendors/renesas/boards/rl78g14-fpb/amazon_freertos_common/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
	if( (pdata == NULL) || (length < 0 ))
	{
		return  WIFI_ERR_PARAMETER;
	}
	if(datatype >= 2)
	{
		return  WIFI_ERR_PARAMETER;
	}

	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}


	mutex_flag = MUTEX_TX | MUTEX_RX;
    if(0 == wifi_take_mutex(mutex_flag))
	{
		sended_length = 0;

		switch(datatype)
		{
		case 0x00:
			/* RootCA */
			sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATNSSLCERT=calist%d.crt,%d\r", (uint8_t)data_id, length);
			break;
		case 0x01:
			/* Certificate & Key */
			sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATNSSLCERT=cert%d.crt,%d\r", (uint8_t)data_id, length);
			break;
		}
		wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, g_command_execute_timeout2, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SYSFALSH_WRITE_DATA, 0xff);


		timeout_init(wifi_command_port, 2000);
		ticket_no = wifi_set_request_in_queue( WIFI_COMMAND_SET_SYSFALSH_WRITE_DATA, 0xff );
		g_wifi_uart[wifi_command_port].tx_end_flag = 0;

		while(sended_length < length)
		{
			if(length - sended_length > g_wifi_tx_busiz_command)
			{
				current_send_length = g_wifi_tx_busiz_command;
			}
			else
			{
				current_send_length = length - sended_length;
			}
			timeout = 0;

			ercd = R_SCI_Send(g_wifi_uart[wifi_command_port].wifi_uart_sci_handle, pdata+sended_length, current_send_length);
			if(SCI_SUCCESS != ercd)
			{
				break;
			}

			while(1)
			{
				if(0 != g_wifi_uart[wifi_command_port].tx_end_flag)
				{
					break;
				}
				vTaskDelay(1);
			}
			sended_length += current_send_length;
			while(1)
			{
				break;
			}
		}
		while(1)
		{
			get_queue = wifi_get_result_from_queue( ticket_no, &result );
			if(0 == get_queue )
			{
				break;
			}

			if(-1 == check_timeout(wifi_command_port, 0))
			{
				timeout = 1;
				break;
			}
			vTaskDelay(1);
		}
		if(timeout == 1)
		{
			wifi_give_mutex(mutex_flag);
			return WIFI_ERR_MODULE_COM;
		}
		if(result != WIFI_RETURN_ENUM_OK)
		{
			wifi_give_mutex(mutex_flag);
			return WIFI_ERR_MODULE_COM;
		}
		/* Give back the socketInUse mutex. */
		wifi_give_mutex(mutex_flag);
    }
    else
    {
    	api_ret = WIFI_ERR_TAKE_MUTEX;
    }
    return api_ret;
}



/**
* @fn
* @brief Request Server Certificate to the Wifi module
*/
wifi_err_t R_WIFI_SX_ULPGN_RequestTlsSocket (int32_t socket_number)
{
	wifi_err_t api_ret = WIFI_SUCCESS;

	if( 0 != R_WIFI_SX_ULPGN_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

	if( (socket_number >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_number < 0) ||
			(g_wifi_socket[socket_number].socket_status != WIFI_SOCKET_STATUS_SOCKET) ||
			(g_wifi_socket[socket_number].protocol != WIFI_SOCKET_IP_PROTOCOL_TCP))
	{
		api_ret = WIFI_ERR_SOCKET_NUM;
	}
	if(WIFI_SUCCESS == api_ret)
	{
		api_ret = wifi_setsslconfiguration(socket_number, 0);
	}
	return api_ret;
}

/**
* @fn
* @brief Set SSL Configration
*/
wifi_err_t wifi_setsslconfiguration (int32_t socket_number, uint8_t ssl_type)
{
//	uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;

	if( (socket_number >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_number < 0) || (ssl_type > 3) ||
			(g_wifi_socket[socket_number].socket_status != WIFI_SOCKET_STATUS_SOCKET) ||
			(g_wifi_socket[socket_number].protocol != WIFI_SOCKET_IP_PROTOCOL_TCP))
	{
		return WIFI_ERR_SOCKET_NUM;
	}

		g_wifi_socket[socket_number].ssl_flag = 1;
		g_wifi_socket[socket_number].ssl_type = ssl_type;
//		g_wifi_socket[socket_number].ssl_type |= ssl_type;

	return api_ret;
}

/**
* @fn
* @brief Erase Server Certificate to the Wifi module
*/
uint32_t erase_certificate (uint8_t *certificate_name)
{
	int32_t ret;

	sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATNSSLCERT=%s,0\r",(char*)certificate_name);
	ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, 1000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SYSFALSH_ERASE_DATA, 0xff);

	return ret;
}

/**
* @fn
* @brief Erase Server Certificate to the Wifi module by name
*/
wifi_err_t R_WIFI_SX_ULPGN_EraseServerCertificate (uint8_t *certificate_name)
{
	wifi_err_t api_ret = WIFI_SUCCESS ;
	wifi_err_t ret;
	uint8_t mutex_flag;
	uint8_t certificate_flg = 0;
	wifi_certificate_infomation_t *certificate_information;
	wifi_certificate_infomation_t cert_info;
	certificate_information = (wifi_certificate_infomation_t*)&cert_info;

	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}

	if(0==certificate_name)
	{
		return WIFI_ERR_PARAMETER;
	}

	ret=R_WIFI_SX_ULPGN_GetServerCertificate(certificate_information);
	if(ret!=0)
	{
		return ret;
	}

	mutex_flag = MUTEX_TX | MUTEX_RX;
    if(0 == wifi_take_mutex(mutex_flag))
	{
    	/* 指定ファイルが存在するかの確認　*/
    	while(certificate_information->certificate_file[0]!=0)
    	{
    		if(0==strcmp((char*)(certificate_information->certificate_file),(char*)certificate_name))
    		{
    			certificate_flg = 1;
    			break;
    		}
    		certificate_information = certificate_information->next_certificate_name;
    	}

    	if(0==certificate_flg)
    	{
    		wifi_give_mutex(mutex_flag);
    		return WIFI_ERR_PARAMETER;
    	}

    	ret = (wifi_err_t)erase_certificate (certificate_name);
		if(ret != 0)
		{
			api_ret = WIRI_ERR_FLASH_ERASE;
			wifi_give_mutex(mutex_flag);
			return api_ret;
		}

		/* Give back the socketInUse mutex. */
		wifi_give_mutex(mutex_flag);
    }
    else
    {
    	api_ret = WIFI_ERR_TAKE_MUTEX;
    }
	return api_ret;
}

/**
* @fn
* @brief Get Server Certificate to the Wifi module
*/
wifi_err_t  R_WIFI_SX_ULPGN_GetServerCertificate (wifi_certificate_infomation_t *wifi_certificate_information)
{
	wifi_err_t api_ret = WIFI_SUCCESS;
	int32_t ret;
	uint8_t mutex_flag;
	wifi_certificate_infomation_t *certificate_information;

	if(NULL == wifi_certificate_information)
	{
		return WIFI_ERR_PARAMETER;
	}

	certificate_information = g_wifi_certificate_information;
	/* Clear Current Certificate Information */
	while(certificate_information->certificate_file[0]!=0)
	{
		memset(&certificate_information->certificate_file,0,sizeof(certificate_information->certificate_file));
		certificate_information = certificate_information->next_certificate_name;
	}
	g_wifi_certificate_information[0].certificate_number=0;

