renesas/amazon-freertos/vendors/renesas/boards/rl78g14-fpb/amazon_freertos_common/network_support/r_wifi_sx_ulpgn_ssl/src/r_wifi_sx_ulpgn_api.c
	api_ret = WIFI_SUCCESS;
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		memcpy(wifi_certificate_information, &g_wifi_certificate_information[0], sizeof(wifi_certificate_infomation_t));
		return WIFI_ERR_NOT_OPEN;
	}

	mutex_flag = MUTEX_TX | MUTEX_RX;
	if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
		return api_ret;
	}
	if(WIFI_SUCCESS==api_ret)
	{
        sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATNSSLCERT=?\r");
        ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, g_command_execute_timeout1, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SYSFALSH_READ_DATA, 0xff);

		if(ret!=WIFI_SUCCESS)
		{
			api_ret = WIFI_ERR_MODULE_COM;
#if DEBUGLOG == 2
			printf("COMMAND DOES NOT SUCCESS\r\n");
#endif
		}
		else if(g_certificate_list_flg != 1)
		{
			api_ret = WIRI_ERR_FLASH_READ;
#if DEBUGLOG == 2
			printf("Get the Certificate information was Fail\r\n");
#endif
		}
		else
		{
			api_ret = WIFI_SUCCESS;
		}
		/* Give back the socketInUse mutex. */
		wifi_give_mutex(mutex_flag);
    }
    else
    {
    	api_ret = WIFI_ERR_TAKE_MUTEX;
    }
    memcpy(wifi_certificate_information, &g_wifi_certificate_information[0], sizeof(wifi_certificate_infomation_t));
    return api_ret;
}

/**
* @fn
* @brief Write Server Certificate to wifi module
*/
wifi_err_t R_WIFI_SX_ULPGN_WriteServerCertificate(uint32_t data_id,uint32_t data_type,const uint8_t *certificate, uint32_t certificate_length)
{
		wifi_err_t api_ret;
		if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
		{
			return WIFI_ERR_NOT_OPEN;
		}
		if( (certificate == NULL) || (certificate_length <= 0 ))
		{
			return  WIFI_ERR_PARAMETER;
		}
		api_ret = R_WIFI_SX_ULPGN_RegistServerCertificate (data_id,data_type, certificate, certificate_length, 0);
		return api_ret;
}

/**
* @fn
* @brief Erase All  Server Certificate to wifi module
*/
wifi_err_t	R_WIFI_SX_ULPGN_EraseAllServerCertificate(void)
{
	wifi_err_t api_ret;
	uint8_t    retry_no;
	wifi_certificate_infomation_t *certificate_information;
	wifi_certificate_infomation_t cert_info;
	certificate_information = (wifi_certificate_infomation_t*)&cert_info;

	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}
	api_ret = R_WIFI_SX_ULPGN_GetServerCertificate(certificate_information);
	if (api_ret!=0)
	{
		return api_ret;
	}
	if (0==certificate_information->certificate_number)
	{
		/* Certificate File is nothing */
		return WIFI_SUCCESS;
	}
	while(certificate_information->certificate_file[0]!=0)
	{
		api_ret = (wifi_err_t)erase_certificate(certificate_information->certificate_file);
		if(WIFI_SUCCESS!=api_ret)
		{
			for(retry_no=0;retry_no<3;retry_no++)
			{
				api_ret = (wifi_err_t)erase_certificate(certificate_information->certificate_file);
				if(WIFI_SUCCESS==api_ret)
				{
					break;
				}
			}
			if(WIFI_SUCCESS!=api_ret)
			{
//				return WIRI_ERR_FLASH_ERASE;
			}
		}
		certificate_information = certificate_information->next_certificate_name;
	}
	return WIFI_SUCCESS;
}

/**
* @fn
* @brief Set Certificate Profile
*/
wifi_err_t	R_WIFI_SX_ULPGN_SetCertificateProfile(uint8_t certificate_id, uint32_t ip_address, const char *server_name)
{
	if ('\0'==server_name)
	{
		memset(certificate_profile[certificate_id].host_name, 0, sizeof(certificate_profile[certificate_id].host_name));
	}
	else
	{
		strcpy(certificate_profile[certificate_id].host_name, server_name);
	}
	certificate_profile[certificate_id].host_address           = ip_address;
	certificate_profile[certificate_id].Certificate_id         = certificate_id;

	return WIFI_SUCCESS;
}

/* For Test */
/**
* @fn
* @brief Take wifi mutext for test mdode
*/
int32_t test_take_mutex(void)
{
	uint8_t mutex_flag;
	mutex_flag = MUTEX_TX | MUTEX_RX;
	return (wifi_take_mutex(mutex_flag));
}
/**
* @fn
* @brief Gibe wifi mutext for test mdode
*/
void test_give_mutex(void)
{
	uint8_t mutex_flag;
	mutex_flag = MUTEX_TX | MUTEX_RX;
	wifi_give_mutex(mutex_flag);
}
/**
* @fn
* @brief Set timeout setting for test mdode
*/
void Set_timeout_ms(uint16_t timeout_ms)
{
	g_command_execute_timeout1 = timeout_ms;
	g_command_execute_timeout2 = timeout_ms;
	g_command_execute_timeout3 = timeout_ms;
	g_command_execute_timeout4 = timeout_ms;
	g_command_execute_timeout5 = timeout_ms;
}

/**
* @fn
* @brief Initialize timeout setting
*/
void Set_timeout_init(void)
{
	g_command_execute_timeout1 = EXECUTE_COMMAND_TIMEOUT_DEFAULT1;
	g_command_execute_timeout2 = EXECUTE_COMMAND_TIMEOUT_DEFAULT2;
	g_command_execute_timeout3 = EXECUTE_COMMAND_TIMEOUT_DEFAULT3;
	g_command_execute_timeout4 = EXECUTE_COMMAND_TIMEOUT_DEFAULT4;
	g_command_execute_timeout5 = EXECUTE_COMMAND_TIMEOUT_DEFAULT5;
}

void r_wifi_sx_ulpgn_give_semaphore(void)
{
	uint8_t mutex_flag;
	mutex_flag = MUTEX_TX | MUTEX_RX;
	wifi_give_mutex(mutex_flag);
}

void SOCKET_GetSocketStatus( void )
{
    uint32_t p_recv, p_send;
    wifi_check_uart_state(&p_recv, &p_send);
printf("recv=%lu: send=%lu\r\n", p_recv, p_send);

	return;
}
